# Интерактивный тренажер по SQL

## 1. Основы реляционной модели и SQL

   #### Содержание 
    Введение
    1.1 Отношение (таблица)
    1.2 Выборка данных
    1.3 Запросы, групповые операции
    1.4 Вложенные запросы
    1.5 Запросы корректировки данных
    1.6 Таблица "Командировки", запросы на выборку
    1.7 Таблица "Нарушения ПДД", запросы корректировки
    
### Введение 

#### Установка Oracle Database и Oracle SQL Developer

- `Oracle Database` - [ПО](https://www.oracle.com/cis/database/technologies/oracle-database-software-downloads.html) объектно-реляционная система управления базами данных компании Oracle;
- `Oracle SQL Developer` - [ПО](https://www.oracle.com/database/sqldeveloper/technologies/download/) интегрированная среда разработки на языках SQL и PL/SQL, с возможностью администрирования баз данных, ориентирована на применение в среде Oracle Database.

После установки через Oracle SQL Developer переходим к настройке подключения к базе данных Oracle Database, щелкаем на + и выбираем «New Connection». В окне вводим данные пользователя, которые использовали при установки, заходим под системным username = SYS. После подключения серверу, отобразится обозреватель объектов и окно для написания SQL запросов. [Более подробней в источнике.](https://info-comp.ru/install-oracle-sql-developer)

**Следующий этап**, нужно создать нового пользователя/схему в Oracle Database для этого вводим команды SQL запросов:

```MYSQL 
/*PL/SLQ*/
ALTER SESSION SET "_ORACLE_SCRIPT"=TRUE; 
CREATE USER stepik_sql IDENTIFIED BY stepik;
```

**Второй этап**, передача Прав(Grant). [Более подробней в источнике.](https://youtu.be/lw_gny4zoEI) 

```MYSQL 
/*PL/SLQ*/
GRANT CREATE SESSION TO STEPIK_SQL;
GRANT CREATE TABLE TO STEPIK_SQL;
GRANT CREATE PROCEDURE TO STEPIK_SQL;
GRANT CREATE TRIGGER TO STEPIK_SQL;
GRANT CREATE VIEW TO STEPIK_SQL;
GRANT CREATE SEQUENCE TO STEPIK_SQL;
GRANT ALTER ANY TABLE TO STEPIK_SQL;
GRANT ALTER ANY PROCEDURE TO STEPIK_SQL;
GRANT ALTER ANY TRIGGER TO STEPIK_SQL;
GRANT ALTER PROFILE TO STEPIK_SQL;
GRANT DELETE ANY TABLE TO STEPIK_SQL;
GRANT DROP ANY TABLE TO STEPIK_SQL;
GRANT DROP ANY PROCEDURE TO STEPIK_SQL;
GRANT DROP ANY TRIGGER TO STEPIK_SQL;
GRANT DROP ANY VIEW TO STEPIK_SQL;
GRANT DROP PROFILE TO STEPIK_SQL;
```
```Python3
GRANT SELECT ON SYS.V_$SESSION TO STEPIK_SQL;
GRANT SELECT ON SYS.V_$SESSTAT TO STEPIK_SQL;
GRANT SELECT ON SYS.V_$STATNAME TO STEPIK_SQL;
GRANT SELECT ANY DICTIONARY TO STEPIK_SQL;
```
**Трейтий этап**, выделение памяти для добавления данных, в Oracle SQL Developer=>Other Users=><наш пользователь>=>Edit User=>Quotas=>USERS=>(Unlimited(V), Quota(100))=>Save

#### Подключение к Oracle Database из Jupyter Notebook

Для этого потребуется установить несколько библиотек. Для работы с Jupyter Notebook использована платформа Anaconda, все нужные библиотеки для работы были установлены именно в эту среду разработки.

##### Установка библиотек

- `ipython-sql` - [пакет](https://anaconda.org/conda-forge/ipython-sql) для работы с SQL запросами;
- `cx_oracle` - [пакет](https://anaconda.org/anaconda/cx_oracle) модуль, обеспечивает доступ к Oracle Database и соответствует спецификации API базы данных Python;
- `sqlalchemy` - ORM для работы с SQL БД.

In [1]:
import sqlalchemy

In [3]:
# 1. Cоздаем соединение, синтаксис sqlalchemy - "oracle+cx_oracle://'+user+':'+pw+'@'+host+':'+port+'/?service_name='+db'?'mode=Role")
sqlalchemy.create_engine("oracle://STEPIK_SQL:stepik@localhost:1521/orcl")

Engine(oracle://STEPIK_SQL:***@localhost:1521/orcl)

In [154]:
# 2. Загружаем extension
#%load_ext sql 
%reload_ext sql

In [155]:
# 3. Проверяем соединение
%sql oracle://STEPIK_SQL:stepik@localhost:1521/orcl

In [7]:
# 4. Проверяем какая версия Oracle Database установлена:
%sql SELECT * FROM v$version

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Oracle Database 19c Enterprise Edition Release 19.0.0.0.0 - Production', 'Oracle Database 19c Enterprise Edition Release 19.0.0.0.0 - Production\nVersion 19.3.0.0.0', 'Oracle Database 19c Enterprise Edition Release 19.0.0.0.0 - Production', 0)]

### 1.1 Отношение (таблица)

#### Создание таблицы
```MYSQL 
/*PL/SLQ*/
CREATE TABLE book (
    book_id INT GENERATED BY DEFAULT ON NULL AS IDENTITY, 
    title VARCHAR(50), 
    author VARCHAR(30), 
    price DECIMAL(8, 2), 
    amount INT
);
```

#### Задание 1.1.1 
_Создание таблицы book_

In [105]:
%%sql

CREATE TABLE book 
(
    book_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY, 
    title VARCHAR(50), 
    author VARCHAR(30), 
    price DECIMAL(8, 2), 
    amount INT
)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 1.1.2 
_Добавлении данных в book_

In [106]:
%%sql

INSERT INTO book (title, author, price, amount) VALUES ('Мастер и Маргарита','Булгаков М.А.',670.99, 3)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [107]:
%%sql
INSERT INTO book (title, author, price, amount) VALUES ('Белая гвардия', 'Булгаков М.А.', 540.50, 5)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [108]:
%%sql
INSERT INTO book (title, author, price, amount) VALUES ('Идиот', 'Достоевский Ф.М.', 460.00, 10)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [109]:
%%sql
INSERT INTO book (title, author, price, amount) VALUES ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [110]:
 %%sql
INSERT INTO book (title, author, price, amount) VALUES ('Стихотворения и поэмы','Есенин С.А.', 650.00, 15)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

## 1.2  Выборка данных
### Структура и наполнение таблицы: 
| book_id | title              | author           | price  | amount |
|---------|--------------------|------------------|--------|--------|
| 1       | Мастер и Маргарита | Булгаков М.А.    | 670.99 | 3      |
| 2       | Белая гвардия      | Булгаков М.А.    | 540.50 | 5      |
| 3       | Идиот              | Достоевский Ф.М. | 460    | 10     |
| 4       | Братья Карамазовы  | Достоевский Ф.М. | 799.01 | 2      |
| 5       | Стихотворения и поэмы  | Есенин С.А. | 650.00 | 15      |

#### Задание 1.2.1
_Вывести информацию о всех книгах, хранящихся на складе_

In [111]:
%%sql
 
SELECT * FROM book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.5'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650'), 15)]

#### Задание 1.2.2 
_Выбрать авторов, название книг и их цену из таблицы book._

In [112]:
%%sql

SELECT author,title, price 
FROM book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('670.99')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('540.5')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01')),
 ('Есенин С.А.', 'Стихотворения и поэмы', Decimal('650'))]

#### Задание 1.2.3 
_Выбрать названия книг и авторов из таблицы book, для поля title задать имя(псевдоним) Название, для поля author –  Автор._

In [12]:
%%sql

SELECT title AS Название, author AS Автор 
FROM book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.'),
 ('Белая гвардия', 'Булгаков М.А.'),
 ('Идиот', 'Достоевский Ф.М.'),
 ('Братья Карамазовы', 'Достоевский Ф.М.'),
 ('Стихотворения и поэмы', 'Есенин С.А.')]

#### Задание 1.2.4 
_Для упаковки каждой книги требуется один лист бумаги, цена которого 1 рубль 65 копеек. 
Посчитать стоимость упаковки для каждой книги (сколько денег потребуется, чтобы упаковать все экземпляры книги). 
В запросе вывести название книги, ее количество и стоимость упаковки, последний столбец назвать pack._

In [13]:
%%sql

SELECT title, amount, 1.65*amount AS pack
FROM book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Мастер и Маргарита', 3, Decimal('4.95')),
 ('Белая гвардия', 5, Decimal('8.25')),
 ('Идиот', 10, Decimal('16.5')),
 ('Братья Карамазовы', 2, Decimal('3.3')),
 ('Стихотворения и поэмы', 15, Decimal('24.75'))]

#### Задание 1.2.5
_В конце года цену всех книг на складе пересчитывают – снижают ее на 30%. 
Написать SQL запрос, который из таблицы book выбирает названия, авторов, количества и вычисляет новые цены книг. 
Столбец с новой ценой назвать new_price, цену округлить до 2-х знаков после запятой._

In [14]:
%%sql

SELECT title, author, amount,
    ROUND((price-(price/100)*30) ,2) as new_price
FROM book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', 3, Decimal('469.69')),
 ('Белая гвардия', 'Булгаков М.А.', 5, Decimal('378.35')),
 ('Идиот', 'Достоевский Ф.М.', 10, 322),
 ('Братья Карамазовы', 'Достоевский Ф.М.', 2, Decimal('559.31')),
 ('Стихотворения и поэмы', 'Есенин С.А.', 15, 455)]

#### Задание 1.2.6 
_При анализе продаж книг выяснилось, что наибольшей популярностью пользуются книги Михаила Булгакова, на втором месте книги Сергея Есенина. Исходя из этого решили поднять цену книг Булгакова на 10%, а цену книг Есенина - на 5%. Написать запрос, куда включить автора, название книги и новую цену, последний столбец назвать new_price. Значение округлить до двух знаков после запятой._

```MySQL
-- Решение в MySQL
SELECT author, title, 
    ROUND(IF(author = 'Булгаков М.А.', (price+(price/100)*10), IF(author = 'Есенин С.А.', (price+(price/100)*5), price)),2) AS new_price
FROM book;
```

In [15]:
%%sql
          
SELECT author, title, ROUND(
    CASE author 
    WHEN 'Булгаков М.А.' THEN (price+(price/100)*10) 
    WHEN 'Есенин С.А.' THEN (price+(price/100)*5) 
    ELSE price 
    END, 2) AS new_price
FROM book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('738.09')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('594.55')),
 ('Достоевский Ф.М.', 'Идиот', 460),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01')),
 ('Есенин С.А.', 'Стихотворения и поэмы', Decimal('682.5'))]

#### Задание 1.2.7 
_Вывести автора, название  и цены тех книг, количество которых меньше 10._

In [16]:
%%sql

SELECT author, title, price
FROM book
WHERE amount<10

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('670.99')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('540.5')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01'))]

#### Задание 1.2.8 
_Вывести название, автора,  цену  и количество всех книг, цена которых меньше 500 или больше 600, а стоимость всех экземпляров этих книг больше или равна 5000._

In [17]:
%%sql

SELECT title, author, price, amount
FROM book
WHERE (price<500 or price>600) and price*amount >=5000

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Стихотворения и поэмы', 'Есенин С.А.', Decimal('650'), 15)]

#### Задание 1.2.9
_Вывести название и авторов тех книг, цены которых принадлежат интервалу от 540.50 до 800 (включая границы),  а количество или 2, или 3, или 5, или 7._

In [18]:
%%sql

SELECT title, author
FROM book
WHERE (price BETWEEN 540.50 AND 800) AND amount in (2,3,5,7)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.'),
 ('Белая гвардия', 'Булгаков М.А.'),
 ('Братья Карамазовы', 'Достоевский Ф.М.')]

#### Задание 1.2.10
_Вывести  автора и название  книг, количество которых принадлежит интервалу от 2 до 14 (включая границы). Информацию  отсортировать сначала по авторам (в обратном алфавитном порядке), а затем по названиям книг (по алфавиту)_

In [19]:
%%sql

SELECT author, title
FROM book
WHERE amount BETWEEN 2 and 14
ORDER BY author DESC, title ASC

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Достоевский Ф.М.', 'Братья Карамазовы'),
 ('Достоевский Ф.М.', 'Идиот'),
 ('Булгаков М.А.', 'Белая гвардия'),
 ('Булгаков М.А.', 'Мастер и Маргарита')]

#### Задание 1.2.11
Вывести название и автора тех книг, название которых состоит из двух и более слов, а инициалы автора содержат букву «С». Считать, что в названии слова отделяются друг от друга пробелами и не содержат знаков препинания, между фамилией автора и инициалами обязателен пробел, инициалы записываются без пробела в формате: буква, точка, буква, точка. Информацию отсортировать по названию книги в алфавитном порядке.

In [20]:
%%sql

SELECT title, author
FROM book
WHERE title LIKE '%_% %_%' AND author LIKE '%С.%'
ORDER BY title

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Стихотворения и поэмы', 'Есенин С.А.')]

## 1.3  Запросы, групповые операции
### Структура и наполнение таблицы: 
| book_id | title              | author           | price  | amount |
|---------|--------------------|------------------|--------|--------|
| 1       | Мастер и Маргарита | Булгаков М.А.    | 670.99 | 3      |
| 2       | Белая гвардия      | Булгаков М.А.    | 540.50 | 5      |
| 3       | Идиот              | Достоевский Ф.М. | 460    | 10     |
| 4       | Братья Карамазовы  | Достоевский Ф.М. | 799.01 | 3      |
| 5       | Игрок              | Достоевский Ф.М. | 480.50 | 10     |
| 6       | Стихотворения и поэмы  | Есенин С.А. | 650.00 | 15      |

```MySQL
/*Изменяем значение количества*/
/*Вставляем новую запись*/
```

In [42]:
%%sql

UPDATE STEPIK_SQL.book SET amount = 3 WHERE title = 'Братья Карамазовы'

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [43]:
%%sql

INSERT INTO STEPIK_SQL.book (book_id, title, author, price, amount) VALUES (5, 'Игрок', 'Достоевский Ф.М.', 480.50, 10)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [44]:
%%sql 

UPDATE STEPIK_SQL.book SET book_id = 6 WHERE title = 'Стихотворения и поэмы'

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [46]:
%%sql 

SELECT * FROM book
ORDER BY book_id

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.5'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 3),
 (5, 'Игрок', 'Достоевский Ф.М.', Decimal('480.5'), 10),
 (6, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650'), 15)]

#### Задание 1.3.1
_Отобрать различные (уникальные) элементы столбца amount таблицы book._

In [47]:
%%sql

SELECT distinct amount 
FROM book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(15,), (5,), (10,), (3,)]

#### Задание 1.3.2
_Посчитать, количество различных книг и количество экземпляров книг каждого автора , хранящихся на складе.  Столбцы назвать Автор, Различных_книг и Количество_экземпляров соответственно._

In [48]:
%%sql

SELECT author as Автор, count(title) as Различных_книг, sum(amount) as Количество_экземпляров
FROM book
GROUP BY author

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', 2, 8), ('Достоевский Ф.М.', 3, 23), ('Есенин С.А.', 1, 15)]

#### Задание 1.3.3
_Вывести фамилию и инициалы автора, минимальную, максимальную и среднюю цену книг каждого автора . Вычисляемые столбцы назвать Минимальная_цена, Максимальная_цена и Средняя_цена соответственно._

In [49]:
%%sql

SELECT author, 
       MIN(price) as Минимальная_цена,
       MAX(price) as Максимальная_цена,
       AVG(price) as Средняя_цена
FROM book
GROUP BY author

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', Decimal('540.5'), Decimal('670.99'), Decimal('605.745')),
 ('Достоевский Ф.М.', 460, Decimal('799.01'), Decimal('579.836666666666666666666666666666666667')),
 ('Есенин С.А.', 650, 650, 650)]

#### Задание 1.3.4
_Для каждого автора вычислить суммарную стоимость книг S (имя столбца Стоимость), а также вычислить налог на добавленную стоимость  для полученных сумм (имя столбца НДС ) , который включен в стоимость и составляет k = 18%,  а также стоимость книг  (Стоимость_без_НДС) без него. Значения округлить до двух знаков после запятой. В запросе для расчета НДС(tax)  и Стоимости без НДС(S_without_tax) использовать следующие формулы:_

$$ tax = \frac{S * \frac{k}{100}}{1+\frac{k}{100}} $$
$$ S\_without\_tax = \frac{S}{1+\frac{k}{100}} $$

In [50]:
%%sql

SELECT author, SUM(price*amount) as Стоимость, 
       ROUND((SUM(price*amount)*0.18)/(1+18 / 100),2) as НДС,
       ROUND((SUM(price*amount)/ 1.18),2) as Стоимость_без_НДС
FROM book
GROUP BY author

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', Decimal('4715.47'), Decimal('719.31'), Decimal('3996.16')),
 ('Достоевский Ф.М.', Decimal('11802.03'), Decimal('1800.31'), Decimal('10001.72')),
 ('Есенин С.А.', 9750, Decimal('1487.29'), Decimal('8262.71'))]

#### Задание 1.3.5
_Вывести  цену самой дешевой книги, цену самой дорогой и среднюю цену уникальных книг на складе. Названия столбцов Минимальная_цена, Максимальная_цена, Средняя_цена соответственно. Среднюю цену округлить до двух знаков после запятой._

In [51]:
%%sql

SELECT ROUND(min(price),2) as Минимальная_цена, 
        ROUND(max(price),2) as Максимальная_цена, 
        ROUND(avg(price),2) as Средняя_цена
FROM book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(460, Decimal('799.01'), Decimal('600.17'))]

#### Задание 1.3.6

_Вычислить среднюю цену и суммарную стоимость тех книг, количество экземпляров которых принадлежит интервалу от 5 до 14, включительно. Столбцы назвать Средняя_цена и Стоимость, значения округлить до 2-х знаков после запятой._

In [52]:
%%sql

SELECT ROUND(AVG(price),2) as Средняя_цена, ROUND(SUM(price*amount),2) as Стоимость
FROM book
WHERE amount BETWEEN 5 and 14

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(Decimal('493.67'), Decimal('12107.5'))]

#### Задание 1.3.7
_Посчитать стоимость всех экземпляров каждого автора без учета книг «Идиот» и «Белая гвардия». В результат включить только тех авторов, у которых суммарная стоимость книг (без учета книг «Идиот» и «Белая гвардия») более 5000 руб. Вычисляемый столбец назвать Стоимость. Результат отсортировать по убыванию стоимости._

In [53]:
%%sql

SELECT author, round(sum(price*amount), 2) as Стоимость
FROM book
WHERE title <> 'Идиот' and title <> 'Белая гвардия'
GROUP by author
HAVING sum(price*amount) > 5000
ORDER BY Стоимость DESC

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Есенин С.А.', 9750), ('Достоевский Ф.М.', Decimal('7202.03'))]

## 1.4 Вложенные запросы
### Структура и наполнение таблицы:

| book_id | title              | author           | price  | amount |
|---------|--------------------|------------------|--------|--------|
| 1       | Мастер и Маргарита | Булгаков М.А.    | 670.99 | 3      |
| 2       | Белая гвардия      | Булгаков М.А.    | 540.50 | 5      |
| 3       | Идиот              | Достоевский Ф.М. | 460    | 10     |
| 4       | Братья Карамазовы  | Достоевский Ф.М. | 799.01 | 3      |
| 5       | Игрок              | Достоевский Ф.М. | 480.50 | 10     |
| 6       | Стихотворения и поэмы  | Есенин С.А. | 650.00 | 15      |

#### Задание 1.4.1
_Вывести информацию (автора, название и цену) о  книгах, цены которых меньше или равны средней цене книг на складе. Информацию вывести в отсортированном по убыванию цены виде. Среднее вычислить как среднее по цене книги._

In [55]:
%%sql

SELECT author, title, price
FROM book
WHERE price <= (SELECT AVG(price)
                FROM book)
ORDER BY price DESC

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', 'Белая гвардия', Decimal('540.5')),
 ('Достоевский Ф.М.', 'Игрок', Decimal('480.5')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460'))]

#### Задание 1.4.2
_Вывести информацию (автора, название и цену) о тех книгах, цены которых превышают минимальную цену книги на складе не более чем на 150 рублей в отсортированном по возрастанию цены виде._

In [56]:
%%sql

SELECT author, title, price
FROM book
WHERE (price - (SELECT MIN(price) FROM book)) <= 150 
ORDER BY price

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Достоевский Ф.М.', 'Идиот', Decimal('460')),
 ('Достоевский Ф.М.', 'Игрок', Decimal('480.5')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('540.5'))]

#### Задание 1.4.3
_Вывести информацию (автора, книгу и количество) о тех книгах, количество экземпляров которых в таблице book не дублируется._

In [57]:
%%sql

SELECT author,title, amount
FROM book
WHERE amount IN(SELECT amount
               FROM book
               GROUP BY amount
               HAVING count(amount) = 1)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', 'Белая гвардия', 5),
 ('Есенин С.А.', 'Стихотворения и поэмы', 15)]

#### Задание 1.4.4
_Вывести информацию о книгах(автор, название, цена), цена которых меньше самой большой из минимальных цен, вычисленных для каждого автора._

In [58]:
%%sql

SELECT author, title, price 
FROM book
WHERE price < ANY (SELECT MIN(price)
                   FROM book
                   GROUP BY author)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', 'Белая гвардия', Decimal('540.5')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460')),
 ('Достоевский Ф.М.', 'Игрок', Decimal('480.5'))]

#### Задание 1.4.5
_Посчитать сколько и каких экземпляров книг нужно заказать поставщикам, чтобы на складе стало одинаковое количество экземпляров каждой книги, равное значению самого большего количества экземпляров одной книги на складе. Вывести название книги, ее автора, текущее количество экземпляров на складе и количество заказываемых экземпляров книг. Последнему столбцу присвоить имя Заказ. В результат не включать книги, которые заказывать не нужно._

In [59]:
%%sql

SELECT title, author, amount, 
        ((SELECT MAX(amount) FROM book) - amount) AS Заказ
FROM book
WHERE (amount - (select max(amount) from book)) <> 0
-- HAVING Заказ <> 0

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', 3, 12),
 ('Белая гвардия', 'Булгаков М.А.', 5, 10),
 ('Идиот', 'Достоевский Ф.М.', 10, 5),
 ('Братья Карамазовы', 'Достоевский Ф.М.', 3, 12),
 ('Игрок', 'Достоевский Ф.М.', 10, 5)]

## 1.5 Запросы корректировки данных
### Структура и наполнение таблицы:

| book_id | title              | author           | price  | amount |
|---------|--------------------|------------------|--------|--------|
| 1       | Мастер и Маргарита | Булгаков М.А.    | 670.99 | 3      |
| 2       | Белая гвардия      | Булгаков М.А.    | 540.50 | 5      |
| 3       | Идиот              | Достоевский Ф.М. | 460    | 10     |
| 4       | Братья Карамазовы  | Достоевский Ф.М. | 799.01 | 2      |
| 5       | Стихотворения и поэмы  | Есенин С.А. | 650.00 | 15      |

In [142]:
%%sql

CREATE TABLE book 
(
    book_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY, 
    title VARCHAR(50), 
    author VARCHAR(30), 
    price DECIMAL(8, 2), 
    amount INT
)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

In [158]:
%%sql
INSERT INTO book (title, author, price, amount) VALUES ('Мастер и Маргарита','Булгаков М.А.',670.99, 3)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [159]:
%%sql
INSERT INTO book (title, author, price, amount) VALUES ('Белая гвардия', 'Булгаков М.А.', 540.50, 5)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [160]:
%%sql
INSERT INTO book (title, author, price, amount) VALUES ('Идиот', 'Достоевский Ф.М.', 460.00, 10)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [161]:
%%sql
INSERT INTO book (title, author, price, amount) VALUES ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [162]:
%%sql
INSERT INTO book (title, author, price, amount) VALUES ('Стихотворения и поэмы','Есенин С.А.', 650.00, 15)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

#### Задание 1.5.1
_Создать таблицу поставка (supply), которая имеет ту же структуру, что и таблиц book._

In [120]:
%%sql

CREATE TABLE supply
(
    supply_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8,2),
    amount INT
)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 1.5.2
_Занесите в таблицу supply четыре записи, чтобы получилась следующая таблица:_

| supply_id | title          | author           | price  | amount |
|-----------|----------------|------------------|--------|--------|
| 1         | Лирика         | Пастернак Б.Л.   | 518.99 | 2      |
| 2         | Черный человек | Есенин С.А.      | 570.20 | 6      |
| 3         | Белая гвардия  | Булгаков М.А.    | 540.50 | 7      |
| 4         | Идиот          | Достоевский Ф.М. | 360.80 | 3      |

In [123]:
%%sql
INSERT INTO supply(title, author, price, amount) VALUES ('Лирика','Пастернак Б.Л.', 518.99, 2)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [124]:
%%sql
INSERT INTO supply(title, author, price, amount) VALUES ('Черный человек', 'Есенин С.А.', 570.20, 6)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [125]:
%%sql
INSERT INTO supply(title, author, price, amount) VALUES ('Белая гвардия', 'Булгаков М.А.', 540.50, 7)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [126]:
%%sql
INSERT INTO supply(title, author, price, amount) VALUES ('Идиот', 'Достоевский Ф.М.', 360.80, 3)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

#### Задание 1.5.3
_Добавить из таблицы supply в таблицу book, все книги, кроме книг, написанных Булгаковым М.А. и Достоевским Ф.М._

In [127]:
%%sql

INSERT INTO book (title, author, price, amount)
SELECT title, author, price, amount
FROM supply
WHERE author <> 'Достоевский Ф.М.' and author <>  'Булгаков М.А.'

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
2 rows affected.

[]

In [128]:
%%sql

SELECT * FROM book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.5'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650'), 15),
 (6, 'Лирика', 'Пастернак Б.Л.', Decimal('518.99'), 2),
 (7, 'Черный человек', 'Есенин С.А.', Decimal('570.2'), 6)]

#### 1.5.4
_Занести из таблицы supply в таблицу book только те книги, авторов которых нет в  book._

In [163]:
%%sql

INSERT INTO book (title, author, price, amount) 
SELECT title, author, price, amount 
FROM supply
WHERE author NOT IN 
(
        SELECT author 
        FROM book
)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [164]:
%%sql
SELECT * FROM book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.5'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650'), 15),
 (6, 'Лирика', 'Пастернак Б.Л.', Decimal('518.99'), 2)]

#### Задание 1.5.5
_Уменьшить на 10% цену тех книг в таблице book, количество которых принадлежит интервалу от 5 до 10, включая границы._

In [166]:
%%sql

UPDATE book
SET price = price - (price/100) * 10 
WHERE amount >= 5 and amount <= 10

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
2 rows affected.

[]

In [167]:
%%sql
SELECT * FROM book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('486.45'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('414'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650'), 15)]

#### Задание 1.5.6
_В таблице book необходимо скорректировать значение для покупателя в столбце buy таким образом, чтобы оно не превышало количество экземпляров книг, указанных в столбце amount. А цену тех книг, которые покупатель не заказывал, снизить на 10%._

In [170]:
%%sql

UPDATE book
SET buy = (CASE WHEN amount < buy THEN buy - (buy-amount) ELSE buy END), 
    price = (CASE WHEN buy = 0 THEN price-(price/100)*10 ELSE price END)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl

DatabaseError: (cx_Oracle.DatabaseError) ORA-00904: "BUY": invalid identifier
[SQL: UPDATE book SET buy = (CASE WHEN amount < buy THEN buy - (buy-amount) ELSE buy END),
    price = (CASE WHEN buy = 0 THEN price-(price/100)*10 ELSE price END)]
(Background on this error at: https://sqlalche.me/e/14/4xp6)

In [ ]:
%%sql
SELECT * FROM book

#### Задание 1.5.7
_Для тех книг в таблице book , которые есть в таблице supply, не только увеличить их количество в таблице book ( увеличить их количество на значение столбца amountтаблицы supply), но и пересчитать их цену (для каждой книги найти сумму цен из таблиц book и supply и разделить на 2)._

In [171]:
%%sql

UPDATE book, supply
SET book.amount = book.amount + supply.amount,
    book.price = (book.price + supply.price)/2 
WHERE book.title = supply.title AND book.author = supply.author

 * oracle://STEPIK_SQL:***@localhost:1521/orcl

DatabaseError: (cx_Oracle.DatabaseError) ORA-00971: missing SET keyword
[SQL: UPDATE book, supply SET book.amount = book.amount + supply.amount,
    book.price = (book.price + supply.price)/2
WHERE book.title = supply.title AND book.author = supply.author]
(Background on this error at: https://sqlalche.me/e/14/4xp6)

In [ ]:
%%sql
SELECT * FROM book

#### Задание 1.5.8
_Удалить из таблицы supply книги тех авторов, общее количество экземпляров книг которых в таблице book превышает 10._

In [183]:
%%sql

DELETE FROM supply
WHERE author IN (SELECT author
                 FROM book
                 GROUP BY author
                 HAVING SUM(amount) > 10)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

In [184]:
%%sql
SELECT * FROM supply

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 1.5.9
_Создать таблицу заказ (ordering), куда включить авторов и названия тех книг, количество экземпляров которых в таблице book меньше среднего количества экземпляров книг в таблице book. В таблицу включить столбец   amount, в котором для всех книг указать одинаковое значение - среднее количество экземпляров книг в таблице book._

In [181]:
%%sql

CREATE TABLE ordering AS
SELECT author, title, 
(SELECT ROUND(AVG(amount)) FROM book) as amount
FROM book
WHERE amount < (SELECT ROUND(AVG(amount)) FROM book)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

In [182]:
%%sql

SELECT * FROM ordering

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', 7),
 ('Булгаков М.А.', 'Белая гвардия', 7),
 ('Достоевский Ф.М.', 'Братья Карамазовы', 7)]